dominion_value = 1
dominion_optional_reality = 309
dominion = RandomSet.create!(
  name: "テストデータ（ドミニオン・ランダマイザー）",
  dict: "ドミニオンで利用できるランダマイザーです。指定数を10枚にして、指定数で引いてください。\nイベント・ランドマーク他を利用する場合は2つ増やし、レアリティ抽選率を100%に設定してください。\n習性については重複する可能性がありますので、重複した際には引き直してください。\n連携カードがある場合で同盟カードがなければ、同盟カード1枚を追加で引いてください。\n前兆カードがある場合で予言カードがなければ、予言カード1枚を追加で引いてください。",
  default_value: -1,
  rate: [{ "value" => 0, "reality" => dominion_optional_reality }],
  pickup_rate: [{ "value" => 0, "reality" => dominion_optional_reality }],
  value_list: [{ "value" => 2, "reality" => dominion_optional_reality }],
  pick_type: "box",
  password: "dominion_card_list"
)

# reality [name, dict, value]
[
  [0, "基本セット", [
      "地下貯蔵庫", "堀", "礼拝堂", "家臣", "工房", "商人", "前駆者", "村", "改築", "鍛冶屋", "金貸し", "玉座の間", "庭園", "密猟者",
      "民兵", "役人", "市場", "衛兵", "議事堂", "研究所", "鉱山", "山賊", "祝祭", "書庫", "職人"
  ]],
  [0, "基本セット-呪い", ["魔女"]],

  [1, "陰謀", [
    "手先", "中庭", "待ち伏せ", "仮面舞踏会", "詐欺師", "執事", "願いの井戸", "貧民街", "外交官", "隠し通路", "共謀者" , "鉱山の村", 
    "男爵", "鉄工所", "橋", "風車", "改良", "交易場", "公爵", "寵臣", "廷臣", "パトロール", "貴族", "ハーレム"
  ]],
  [1, "陰謀-呪い", ["拷問人", "身代わり"]],

  [2, "海辺", [
    "真珠取り", "停泊所", "灯台", "漁村", "倉庫", "大使", "密輸人", "見張り", "巾着切り", "航海士", "島", "隊商", "宝の地図", "引揚水夫", 
    "策士", "商船", "前哨地", "探検隊", "バザー", "船着場", "宝物庫", "幽霊船"
  ]],
  [1, "海辺-呪い", ["海の妖婆"]],
  [1, "海辺-呪い 抑留トークン", ["抑留"]],
  [1, "海辺-原住民の村マット", ["原住民の村"]],
  [1, "海辺-コイントークン", ["海賊船"]],

  [3, "錬金術", ["薬草商", "弟子"]],
  [3, "錬金術-ポーション", ["ブドウ園", "変成", "大学", "念視の泉", "薬師", "賢者の石", "錬金術師", "ゴーレム", ]],
  [3, "錬金術-呪い ポーション", ["使い魔"]],

  [4, "繁栄", [
    "借金", "望楼", "石切場", "護符", "労働者の村", "会計所", "玉璽", "禁制品", "造幣所", "大衆", "投機", "都市", "保管庫", "大市場", 
    "隠し財産", "拡張", "宮廷", "銀行", "鋳造", "行商人"
  ]],
  [4, "繁栄-交易路マット", ["交易路"]],
  [4, "繁栄-勝利点トークン", ["記念碑", "司教", "ならず者"]],
  [4, "繁栄-呪い", ["香具師"]],

  [5, "収穫祭", ["村落", "移動動物園", "占い師", "馬商人", "再建", "農村", "収穫", "狩猟団", "豊穣の角笛", "品評会"]],
  [5, "収穫祭-褒賞カード（王冠、王女、金貨袋、名馬、郎党）", ["馬上槍試合"]],
  [5, "収穫祭-呪い 災いカード（2～3コストの王国カード）", ["魔女娘"]],
  [5, "収穫祭-呪い", ["道化師"]],

  [6, "異郷", [
    "岐路", "愚者の黄金", "公爵夫人", "オアシス", "開発", "画策", "坑道", "神託", "義賊", "交易人", "香辛料商人", "シルクロード", 
    "遊牧民の野営地", "よろずや", "街道", "官吏", "厩舎", "大使館", "地図職人", "値切り屋", "辺境伯", "埋蔵金", "宿屋", "国境の村", "農地"
  ]],
  [6, "異郷", ["不正利得"]],

  [7, "暗黒時代", [
    "救貧院", "従者", "浮浪者", "物乞い", "青空市場", "賢者", "採集者", "物置", "金物商", "吟遊詩人", "行進", "ゴミあさり", "死の荷車",
    "城塞", "ネズミ", "武器庫", "封土", "偽造通貨", "狂信者", "屑屋", "建て直し", "地下墓所", "盗賊", "墓暴き", "伯爵", "はみだし者",
    "秘術師", "狩場", "祭壇"
  ]],
  [7, "暗黒時代-狂人の山札", ["隠遁者"]],
  [7, "暗黒時代-傭兵の山札", ["浮浪児"]],
  [7, "暗黒時代-略奪品", ["襲撃者", "山賊の宿泊地", "略奪"]],
  [7, "暗黒時代-騎士の山札", ["騎士"]],

  [8, "ギルド", ["石工", "医師", "名品", "徴税吏", "助言者", "伝令官", "熟練工", ]],
  [8, "ギルド-財源トークン", ["蝋燭職人", "広場", "商人ギルド", "肉屋", "パン屋"]],
  [8, "ギルド-呪い", ["預言者"]],

  [9, "冒険", [
    "倒壊", "鼠取り", "隊商の護衛", "地下牢", "道具", "魔除け", "カササギ", "使者", "港町", "失われし都市", "語り部", "工匠", "呪いの森",
    "橋の下のトロル", "掘出物", "雇人"
  ]],
  [9, "冒険-酒場マット", ["鼠取り", "法貨", "案内人", "守銭奴", "複製", "変容", "遠隔地", "御料車", "ワイン商"]],
  [9, "冒険-旅トークン", ["山守", "巨人"]],
  [9, "冒険-(-1)カード", ["遺物"]],
  [9, "冒険-呪い", ["沼の妖婆"]],
  [9, "冒険-トラベラー（トレジャーハンター、ウォリアー、ヒーロー、チャンピオン）", ["騎士見習い"]],
  [9, "冒険-トラベラー（兵士、脱走兵、門下生、教師）", ["農民"]],
  [dominion_optional_reality, "冒険-イベント", [
    "探索", "施し", "保存", "移動遊園地", "偵察隊", "焚火", "探検", "立案", "使節団", "交易"
  ]],
  [dominion_optional_reality, "冒険-イベント (-1)カード", ["借入", "奇襲"]],
  [dominion_optional_reality, "冒険-イベント (-1)トークン", ["舞踏会"]],
  [dominion_optional_reality, "冒険-イベント (-2)トークン", ["渡し船"]],
  [dominion_optional_reality, "冒険-イベント 旅トークン", ["巡礼"]],
  [dominion_optional_reality, "冒険-イベント 購入トークン", ["海路"]],
  [dominion_optional_reality, "冒険-イベント (+1)トークン", ["鍛錬"]],
  [dominion_optional_reality, "冒険-イベント (+1)アクショントークン", ["失われた技術"]],
  [dominion_optional_reality, "冒険-イベント (+1)屋敷トークン", ["相続"]],
  [dominion_optional_reality, "冒険-イベント (+1)カードトークン", ["誘導"]],

  [10, "帝国", [
    "開拓者/騒がしい村", "陣地/鹵獲品", "パトリキ/エンポリウム", "女魔術師", "戦車競走", "農家の市場",
    "生贄", "ヴィラ", "神殿", "御守り", "冠", "軍団兵", "公共広場", "資料庫", "庭師"
  ]],
  [10, "帝国-負債トークン", ["剣闘士/大金", "元手", "技術者", "王室の鍛冶屋", "市街", "大君主"]],
  [10, "帝国-ワイルドハントの山札", ["ワイルドハント"]],
  [10, "帝国-呪い", ["投石器/石"]],
  [10, "帝国-城セット", ["城"]],
  [dominion_optional_reality, "帝国-イベント", ["昇進", "掘進", "宴会", "意外な授かり物"]],
  [dominion_optional_reality, "帝国-イベント 負債トークン", ["徴税", "寄付", "併合"]],
  [dominion_optional_reality, "帝国-イベント 勝利点トークン", ["儀式", "大地への塩まき", "結婚式", "征服", "制圧"]],
  [dominion_optional_reality, "帝国-イベント 負債・勝利点トークン", ["凱旋"]],
  [dominion_optional_reality, "帝国-ランドマーク", ["狼の巣", "オベリスク", "凱旋門", "果樹園", "壁", "宮殿", "山賊の砦", "塔", "砦", "博物館", "噴水"]],
  [dominion_optional_reality, "帝国-ランドマーク 勝利点トークン", ["公会堂", "水道橋", "戦場", "闘技場", "墓場", "迷宮", "浴場", "列柱"]],
  [dominion_optional_reality, "帝国-ランドマーク 負債・勝利点トークン", ["峠"]],
  [dominion_optional_reality, "帝国-ランドマーク 呪い・勝利点トークン", ["汚された神殿"]],

  [11, "夜想曲", ["修道院", "守護者", "忠犬", "ゴーストタウン", "取り替え子", "夜警", "コンクラーベ", "悪人のアジト", "カブラー", "納骨堂", "夜襲"]],
  [11, "夜想曲-家宝：魔法のランプ", ["秘密の洞窟"]],
  [11, "夜想曲-家宝：牧草地", ["羊飼い"]],
  [11, "夜想曲-家宝：呪いの鏡", ["墓地"]],
  [11, "夜想曲-家宝：呪われた金貨", ["プーカ"]],
  [11, "夜想曲-幸運 家宝：革袋", ["追跡者"]],
  [11, "夜想曲-幸運 家宝：ヤギ", ["ピクシー"]],
  [11, "夜想曲-幸運 家宝：幸運のコイン", ["ピクシー"]],
  [11, "夜想曲-幸運", ["ドルイド", "詩人", "恵みの村", "聖なる木立ち"]],
  [11, "夜想曲-幸運 呪い", ["偶像"]],
  [11, "夜想曲-不運/状態/呪い 願いカード", ["レプラコーン"]],
  [11, "夜想曲-不運/状態/呪い", ["暗躍者", "人狼", "呪われた村"]],
  [11, "夜想曲-不運/状態/呪い コウモリカード", ["吸血鬼"]],
  [11, "夜想曲-不運/状態/呪い インプカード", ["迫害者"]],
  [11, "夜想曲-インプカード", ["悪魔の工房"]],
  [11, "夜想曲-精霊カード", ["悪魔祓い"]],
  [11, "夜想曲-ゾンビデッキ", ["ネクロマンサー"]],
  [11, "夜想曲-財宝デッキ", ["悲劇のヒーロー"]],

  [12, "ルネサンス", ["貨物船", "実験", "増築", "研究", "山村", "司祭", "発明家", "王笏", "学者", "先見者"]],
  [12, "ルネサンス-ランタン/角笛", ["国境警備隊"]],
  [12, "ルネサンス-旗", ["旗手"]],
  [12, "ルネサンス-村人マット 財源トークン", ["追従者", "劇団", "絹商人", "パトロン", "彫刻家", "帳簿官"]],
  [12, "ルネサンス-財源トークン", ["ドゥカート金貨", "悪党", "香辛料"]],
  [12, "ルネサンス-財源トークン 宝箱", ["剣客"]],
  [12, "ルネサンス-財宝カード 鍵", ["出納官"]],
  [12, "ルネサンス-呪い", ["根城", "老魔女"]],
  [dominion_optional_reality, "プロジェクト", [
    "下水道", "城門", "星図", "大聖堂", "縁日", "サイロ", "艦隊", "資本主義", "道路網", "ピアッツァ", "技術革新", "兵舎", "輪作", "運河", "山砦"
  ]],
  [dominion_optional_reality, "プロジェクト-財源トークン", ["野外劇", "ギルド集会所"]],
  [dominion_optional_reality, "プロジェクト-村人マット 財源トークン", ["探査", "学園"]],
  [dominion_optional_reality, "プロジェクト-トークン", ["悪巧み"]],

  [13, "移動動物園", [
    "備蓄品", "牧羊犬", "ヤギ飼い", "雪深い村", "ラクダの隊列", "賞金稼ぎ", "枢機卿", "村有緑地", "強制退去", "首謀者", "狩猟小屋", "聖域",
    "鷹匠", "艀", "門番", "炉", "漁師", "行人", "デストリエ", "動物見本市"
  ]],
  [13, "移動動物園-馬", ["そり", "配給品", "がらくた", "騎兵隊", "旅籠", "馬丁", "貸し馬屋", "パドック"]],
  [13, "移動動物園-呪い", ["黒猫", "魔女の集会"]],
  [dominion_optional_reality, "移動動物園-イベント", [
    "遅延", "苦労", "追求", "博打", "進軍", "増大", "輸送", "今を生きる", "投資", "放逐", "商売", "借り入れ", "包領", "植民", "同盟"
  ]],
  [dominion_optional_reality, "移動動物園-イベント 呪い", ["絶望"]],
  [dominion_optional_reality, "移動動物園-イベント 馬", ["乗馬", "特価品", "暴走", "要求"]],
  [dominion_optional_reality, "移動動物園-習性", [
    "アザラシの習性", "馬の習性", "ウミガメの習性", "雄牛の習性", "カエルの習性", "カメレオンの習性", "カワウソの習性", "サルの習性",
    "チョウの習性", "ドブネズミの習性", "羊の習性", "フクロウの習性", "豚の習性", "ミミズの習性", "モグラの習性", "ヤギの習性",
    "ラクダの習性", "ラバの習性", "リスの習性"
  ]],
  [dominion_optional_reality, "移動動物園-習性 脇に置くカード（2～3コストの王国カード）", ["ハツカネズミの習性"]],

  [14, "同盟", [
    "町民（触れ役/蹄鉄工/粉屋/長老）", "叙事詩（古地図/航海/沈没船の財宝/遠い海岸）", "衝突（戦闘計画/射手/将軍/領土）", "商人の野営地", "歩哨",
    "王家のガレー船", "急使", "大工", "町", "宿屋の主人", "追いはぎ", "改造", "狩人", "ガレリア", "交換", "散兵", "首都", "専門家", "侯爵"
  ]],
  [14, "同盟-連携 好意マット 財産トークン", ["ごますり", "道化棒", "下役", "輸入者", "仲買人", "ギルドマスター", "契約書", "密使"]],
  [14, "同盟-トークン", ["城砦（天幕/駐屯地/堡塁/要塞）"]],
  [14, "同盟-呪い", ["卜占官（薬草集め/侍祭/女魔道士/女預言者）", "蛮族"]],
  [14, "同盟-連携 呪い 好意マット 財産トークン", ["魔法使い（生徒/霊術師/魔道士/リッチ）"]],
  [dominion_optional_reality, "同盟-同盟カード", [
    "穴居民", "市場の町", "沿岸の避難港", "銀行家連盟", "建築家ギルド", "工芸家ギルド", "高原の羊飼い", "小売店主連盟", "砂漠の案内人",
    "写本士の仲間たち", "すり師団", "占星術師団", "島民", "都市国家", "発明家の家族", "平和的教団", "メイソン団", "木工ギルド", "森の居住者",
    "山の民", "遊牧民団", "罠師の小屋"
  ]],
  [dominion_optional_reality, "同盟-同盟カード 呪い", ["魔女の輪"]],

  [15, "略奪", [
    "岩屋", "檻", "シャーマン", "現場監督", "秘境の社", "密航者", "置き去り", "旗艦", "キャビンボーイ", "工具", "ゴンドラ", "財産目当て",
    "上陸部隊", "地図作り", "縄", "沼地の小屋", "豊穣", "港の村", "坩堝", "一等航海士", "埋められた財宝", "拡大", "銀山", "鉱山道路",
    "巡礼者", "小像", "操舵手", "乗組員", "フリゲート船", "ペンダント", "ロングシップ", "王の隠し財産"
  ]],
  [15, "略奪-戦利品デッキ", ["調査", "宝飾卵", "価値ある村", "切り裂き魔", "つるはし", "戦利品の袋"]],
  [15, "略奪-呪い", ["セイレーン", "トリックスター"]],
  [dominion_optional_reality, "略奪-イベント", ["埋葬", "回避", "突貫", "配達", "鏡映", "準備", "発信", "物色", "大渦巻", "旅行"]],
  [dominion_optional_reality, "略奪-イベント 戦利品デッキ", ["危難", "襲撃", "略奪行為", "侵略", "繁栄"]],
  [dominion_optional_reality, "略奪-特性", [
    "安価な", "受け継がれた", "内気な", "運命の", "近隣の", "経験な", "鼓舞する", "せっかちな", "疲れ知らずの", "忍耐強い", "無謀な",
    "有効的な", "豊かな"
  ]],
  [dominion_optional_reality, "略奪-特性 呪い 戦利品デッキ", ["呪われた"]],

  [16, "旭日", ["公家", "米", "侍", "札差", "浪人", "忍者", "小路", "魚屋", "狸"]],
  [16, "旭日-負債トークン", ["交替", "室", "名匠", "金山", "勅使", "駕籠", "絵師", "大名"]],
  [16, "旭日-前兆 Sunトークン", ["田舎の村", "川の社", "歌人", "茶屋"]],
  [16, "旭日-前兆 Sunトークン 負債トークン", ["山の社"]],
  [16, "旭日-呪い", ["濡女"]],
  [16, "旭日-前兆 Sunトークン 呪い", ["狐"]],
  [16, "旭日-脇に置くカード（5コストの王国カード）", ["川船"]],
  [dominion_optional_reality, "旭日-イベント", ["蓄積", "苦行", "洞察", "金継ぎ", "稽古", "海上交易", "三時", "参集"]],
  [dominion_optional_reality, "旭日-イベント 負債トークン", ["信用", "継続"]],
  [dominion_optional_reality, "旭日-予言", ["好機到来", "官僚制", "悟り", "盛大な取引", "豊作", "偉大な指導者", "成長", "神風", "神器", "狼狽", "進歩", "急速拡大"]],
  [dominion_optional_reality, "旭日-予言 アタックを持つ王国カードを1つサプライに追加", ["来冠"]],
  [dominion_optional_reality, "旭日-予言 負債トークン", ["厳冬"]],
  [dominion_optional_reality, "旭日-予言 呪い", ["病"]]
].each do |card_list_number, card_list_dict, card_list_supplies|
  card_list_supplies.each do |supply|
    Lottery.create!(
      name: supply,
      reality: card_list_number,
      dict: card_list_dict,
      value: dominion_value,
      random_set_id: dominion.id,
      origin_id: dominion.id
    )
  end
end


trump = RandomSet.create!(
  name: "テストデータ（トランプ）",
  dict: "トランプを再現したものです。",
  default_value: 54,
  rate: [{ "value" => 0, "reality" => 0 }],
  pickup_rate: [{ "value" => 0, "reality" => 0 }],
  pick_type: "box",
  password: "trump_card_list"
)

[
  [1, 300, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [1, 301, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [1, 302, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [1, 303, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [2, 308, ["JOKER"]]
].each do |value, suit, number_list|
  number_list.each do |number|
    Lottery.create!(
      name: number,
      reality: suit,
      value: value,
      random_set_id: trump.id,
      origin_id: trump.id
    )
  end
end


blackjack = RandomSet.create!(
  name: "テストデータ（ブラックジャック）",
  dict: "カジノ方式で８つのトランプのデッキを纏めてあります。",
  default_value: 416,
  rate: [{ "value" => 0, "reality" => 0 }],
  pickup_rate: [{ "value" => 0, "reality" => 0 }],
  pick_type: "box",
  password: "black_jack_card_list"
)

[
  [8, 300, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [8, 301, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [8, 302, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]],
  [8, 303, ["A", 2, 3, 4, 5, 6, 7, 8, 9, 10, "J", "Q", "K"]]
].each do |value, suit, number_list|
  number_list.each do |number|
    Lottery.create!(
      name: number,
      reality: suit,
      value: value,
      random_set_id: blackjack.id,
      origin_id: blackjack.id
    )
  end
end
